# Data Science Part Time Course

## Week 5 - Lesson 2 - Lab: Databases with Python

In this Lab the goal is connect to a database (created form a local file), read the data into Python and interact with it.

## 1. Data import

Connect to the file 'assets/datasets/enron.db' using one of these methods:

- sqlite3 python package
- pandas.read_sql
- SQLite Manager Firefox extension

Take a look at the database and query the master table. How many Tables are there in the db?

> Answer:
There are 3 tables:
- MessageBase
- RecipientBase
- EmployeeBase

In [3]:
import sqlite3
conn = sqlite3.connect('../../../../data/enron.db') 
c = conn.cursor()
c.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()

[('MessageBase',), ('RecipientBase',), ('EmployeeBase',)]

Query the `sqlite_master` table to retrieve the **schema** of the `EmployeeBase` table.

1. What fields are there?


1. What's the type of each of them?

In [5]:
fields = c.execute("SELECT sql from sqlite_master WHERE type='table' and name='MessageBase';").fetchall()
print (''.join(fields[0]))

fields = c.execute("SELECT sql from sqlite_master WHERE type='table' and name='RecipientBase';").fetchall()
print (''.join(fields[0]))

fields = c.execute("SELECT sql from sqlite_master WHERE type='table' and name='EmployeeBase';").fetchall()
print (''.join(fields[0]))

CREATE TABLE MessageBase (
    mid INTEGER,
    filename TEXT,
    unix_time INTEGER,
    subject TEXT,
    from_eid INTEGER,

    PRIMARY KEY(mid ASC),
    FOREIGN KEY(from_eid) REFERENCES Employee(eid)
)
CREATE TABLE RecipientBase (
    mid INTEGER,
    rno INTEGER,
    to_eid INTEGER,

    PRIMARY KEY(mid ASC, rno ASC)
    FOREIGN KEY(mid) REFERENCES Message(mid)
    FOREIGN KEY(to_eid) REFERENCES Employee(eid)
)
CREATE TABLE EmployeeBase (
                  [eid] INTEGER,
  [name] TEXT,
  [department] TEXT,
  [longdepartment] TEXT,
  [title] TEXT,
  [gender] TEXT,
  [seniority] TEXT

                  )

1. Print the first 5 rows of EmployeeBase table
1. Print the first 5 rows of MessageBase table
1. Print the first 5 rows of RecipientBase table

**Hint**  use `SELECT` and `LIMIT`.

In [11]:
results = c.execute("SELECT * FROM EmployeeBase LIMIT 5;").fetchall()
for row in results:
    print (row)

(1, 'John Arnold', 'Forestry', 'ENA Gas Financial', 'VP Trading', 'Male', 'Senior')
(2, 'Harry Arora', 'Forestry', 'ENA East Power', 'VP Trading', 'Male', 'Senior')
(3, 'Robert Badeer', 'Forestry', 'ENA West Power', 'Mgr Trading', 'Male', 'Junior')
(4, 'Susan Bailey', 'Legal', 'ENA Legal', 'Specialist Legal', 'Female', 'Junior')
(5, 'Eric Bass', 'Forestry', 'ENA Gas Texas', 'Trader', 'Male', 'Junior')

In [12]:
results = c.execute("SELECT * FROM MessageBase LIMIT 5;").fetchall()
for row in results:
    print (row)

(1, 'taylor-m/sent/11', 910930020, 'Cd$ CME letter', 138)
(2, 'taylor-m/sent/17', 911459940, 'Indemnification', 138)
(3, 'taylor-m/sent/18', 911463840, 'Re: Indemnification', 138)
(4, 'taylor-m/sent/23', 911874180, 'Re: Coral Energy, L.P.', 138)
(5, 'taylor-m/sent/27', 912396120, 'Bankruptcy Code revisions', 138)

In [16]:
results = c.execute("SELECT * FROM RecipientBase LIMIT 10;").fetchall()
for row in results:
    print (row)
    
# The first field is message id, the second is recipient number, and the third is the id of the recipient.
# mid, rno, to_eid

(1, 1, 59)
(2, 1, 15)
(3, 1, 15)
(4, 1, 109)
(4, 2, 49)
(4, 3, 120)
(4, 4, 59)
(5, 1, 45)
(5, 2, 53)
(6, 1, 113)

Now try other SQL statements on the local database, such as SELECT .... FROM ... WHERE ....

For example, print the records of EmployeeBase where the Gender is male

In [25]:
results = c.execute("SELECT * FROM EmployeeBase WHERE Gender == 'Male' LIMIT 1000;")
for row in results:
    print (row)

(1, 'John Arnold', 'Forestry', 'ENA Gas Financial', 'VP Trading', 'Male', 'Senior')
(2, 'Harry Arora', 'Forestry', 'ENA East Power', 'VP Trading', 'Male', 'Senior')
(3, 'Robert Badeer', 'Forestry', 'ENA West Power', 'Mgr Trading', 'Male', 'Junior')
(5, 'Eric Bass', 'Forestry', 'ENA Gas Texas', 'Trader', 'Male', 'Junior')
(6, 'Don Baughman Jr.', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(8, 'Robert Benson', 'Forestry', 'ENA East Power', 'Dir Trading', 'Male', 'Senior')
(11, 'Rick Buy', 'Forestry', 'Enron', 'VP & CRO', 'Male', 'Senior')
(12, 'Larry Campbell', 'Other', 'ETS', 'Specialist', 'Male', 'Junior')
(13, 'Larry F. Campbell', 'Other', 'ENA East Power', 'Specialist', 'Male', 'Junior')
(14, 'Mike Carson', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(18, 'Sean Crandall', 'Forestry', 'ENA West Power', 'Dir Trading', 'Male', 'Senior')
(19, 'Martin Cuilla', 'Forestry', 'ENA Gas Central', 'Mgr Trading', 'Male', 'Junior')
(20, 'Jeff Dasovich', 'Legal', 'Regulatory and Government Affairs', 'Director', 'Male', 'Senior')
(22, 'Clint Dean', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(23, 'Craig Dean', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(24, 'David W. Delainey', 'Other', 'EWS', 'President & CEO', 'Male', 'Senior')
(25, 'James Derrick Jr.', 'Legal', 'Enron', 'VP & Gen Cnsl', 'Male', 'Senior')
(28, 'Tom Donohoe', 'Forestry', 'ENA Gas Central', 'Mgr Trading', 'Male', 'Junior')
(29, 'Chris Dorland', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(30, 'Frank Ermis', 'Forestry', 'ENA Gas West', 'Dir Trading', 'Male', 'Senior')
(31, 'Daren J. Farmer', 'Forestry', 'ENA Gas Texas', 'Dir Trading', 'Male', 'Senior')
(33, 'John M. Forney', 'Forestry', 'ENA East Power', 'Dir Trading', 'Male', 'Senior')
(34, 'Drew Fossum', 'Legal', 'ETS', 'VP & Gen Cnsl', 'Male', 'Senior')
(36, 'Randall L. Gay', 'Other', 'ENA Gas West', 'Associate', 'Male', 'Junior')
(37, 'Rob G. Gay', 'Other', 'NA', 'Employee', 'Male', 'Junior')
(39, 'Chris Germany', 'Forestry', 'ENA Gas East', 'Mgr Trading', 'Male', 'Junior')
(40, 'Doug Gilbert-Smith', 'Forestry', 'ENA East Power', 'Dir Trading', 'Male', 'Senior')
(41, 'Darron C. Giron', 'Forestry', 'Energy Operations', 'Mgr Trading', 'Male', 'Junior')
(42, 'John Griffith', 'Forestry', 'ENA Gas Financial', 'Mgr Trading', 'Male', 'Junior')
(43, 'Mike Grigsby', 'Forestry', 'ENA Gas West', 'VP Trading', 'Male', 'Senior')
(44, 'Mark Guzman', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(45, 'Mark E. Haedicke', 'Legal', 'ENA Legal', 'Mng Director & Gen Cnsl', 'Male', 'Senior')
(47, 'Steven Harris', 'Other', 'ETS', 'VP', 'Male', 'Senior')
(48, 'Rod Hayslett', 'Other', 'ETS', 'VP & CFO', 'Male', 'Senior')
(50, 'Scott Hendrickson', 'Forestry', 'ENA Gas East', 'Dir Trading', 'Male', 'Senior')
(51, 'Juan Hernandez', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(53, 'Jeffrey T. Hodge', 'Legal', 'ENA Legal', 'VP & Asst Gen Cnsl', 'Male', 'Senior')
(54, 'John Hodge', 'Forestry', 'ENA Gas East', 'Dir Trading', 'Male', 'Senior')
(55, 'Keith Holst', 'Forestry', 'ENA Gas West', 'Dir Trading', 'Male', 'Senior')
(56, 'Stanley Horton', 'Other', 'ETS', 'President & CEO', 'Male', 'Senior')
(57, 'Kevin Hyatt', 'Other', 'ETS', 'Director', 'Male', 'Senior')
(58, 'Dan J. Hyvl', 'Legal', 'ENA Legal', 'Employee', 'Male', 'Junior')
(60, 'Vince J. Kaminski', 'Other', 'EWS', 'Mng Director Research', 'Male', 'Senior')
(61, 'Steven J. Kean', 'Other', 'Enron', 'VP & Chief of Staff', 'Male', 'Senior')
(62, 'Peter F. Keavey', 'Forestry', 'ENA Gas East', 'Mgr Trading', 'Male', 'Junior')
(64, 'Jeff King', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(67, 'John J. Lavorato', 'Other', 'EWS', 'ENA President & CEO', 'Male', 'Senior')
(68, 'Kenneth Lay', 'Other', 'Enron', 'President & CEO', 'Male', 'Senior')
(69, 'Matthew Lenhart', 'Other', 'ENA Gas West', 'Analyst', 'Male', 'Junior')
(70, 'Andrew H. Lewis', 'Forestry', 'ENA Gas Central', 'Dir Trading', 'Male', 'Senior')
(71, 'Eric Linder', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(73, 'Teb Lokey', 'Other', 'ETS', 'Employee', 'Male', 'Junior')
(74, 'Phillip M. Love', 'Other', 'Energy Operations', 'Specialist', 'Male', 'Junior')
(75, 'Paul T. Lucci', 'Forestry', 'ENA Gas West', 'Dir Trading', 'Male', 'Senior')
(76, 'Mike Maggi', 'Forestry', 'ENA Gas Financial', 'Dir Trading', 'Male', 'Senior')
(78, 'Thomas A. Martin', 'Forestry', 'ENA Gas Texas', 'VP Trading', 'Male', 'Senior')
(79, 'Larry May', 'Forestry', 'ENA Gas Financial', 'Dir Trading', 'Male', 'Senior')
(80, 'Danny McCarty', 'Other', 'ETS', 'VP & CTO', 'Male', 'Senior')
(81, 'Mark McConnell', 'Other', 'ETS', 'Director', 'Male', 'Senior')
(82, 'Mike McConnell', 'Other', 'EWS', 'EGM President & CEO', 'Male', 'Senior')
(83, 'Brad McKay', 'Forestry', 'ENA Gas East', 'Dir Trading', 'Male', 'Senior')
(84, 'Jonathan McKay', 'Forestry', 'ENA Gas East', 'Dir Trading', 'Male', 'Senior')
(85, 'Errol McLaughlin Jr.', 'Other', 'Energy Operations', 'Specialist', 'Male', 'Junior')
(86, 'Steven Merris', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(87, 'Bert Meyers', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(89, 'Matt Motley', 'Forestry', 'ENA West Power Real Time', 'Dir Trading', 'Male', 'Senior')
(90, 'Scott Neal', 'Forestry', 'ENA Gas East', 'VP Trading', 'Male', 'Senior')
(91, 'Gerald Nemec', 'Legal', 'ENA Legal', 'Manager', 'Male', 'Junior')
(93, 'Joe Parks', 'Forestry', 'ENA Gas Central', 'Mgr Trading', 'Male', 'Junior')
(96, 'Vladi Pimenov', 'Other', 'ENA Gas East', 'Associate', 'Male', 'Junior')
(97, 'Phillip Platter', 'Other', 'ENA West Power', 'Specialist', 'Male', 'Junior')
(98, 'Kevin M. Presto', 'Forestry', 'ENA East Power', 'VP Trading', 'Male', 'Senior')
(99, 'Joe Quenet', 'Forestry', 'ENA East Power', 'Mgr Trading', 'Male', 'Junior')
(100, 'Dutch Quigley', 'Other', 'ENA Gas Financial', 'Associate', 'Male', 'Junior')
(101, 'Bill Rapp', 'Legal', 'ETS', 'Attorney', 'Male', 'Junior')
(102, 'Jay Reitmeyer', 'Other', 'ENA Gas West', 'Associate', 'Male', 'Junior')
(103, 'Cooper Richey', 'Other', 'ENA West Power', 'Associate', 'Male', 'Junior')
(105, 'Richard Ring', 'Other', 'EES', 'Employee', 'Male', 'Junior')
(107, 'Benjamin Rogers', 'Other', 'ENA East Power', 'Associate', 'Male', 'Junior')
(108, 'Kevin Ruscitti', 'Forestry', 'ENA Gas Central', 'Mgr Trading', 'Male', 'Junior')
(110, 'Eric Saibi', 'Other', 'ENA East Power', 'Analyst', 'Male', 'Junior')
(111, 'Holden Salisbury', 'Other', 'ENA West Power', 'Analyst', 'Male', 'Junior')
(113, 'Richard B. Sanders', 'Legal', 'ENA Legal', 'VP & Asst Gen Cnsl', 'Male', 'Senior')
(115, 'Darrell Schoolcraft', 'Other', 'ETS', 'Employee', 'Male', 'Junior')
(116, 'Jim Schwieger', 'Forestry', 'ENA Gas Texas', 'Trader', 'Male', 'Junior')
(121, 'Jeffrey A. Shankman', 'Other', 'EWS', 'COO', 'Male', 'Senior')
(122, 'Richard Shapiro', 'Legal', 'Regulatory and Government Affairs', 'VP of Regulatory Affairs', 'Male', 'Senior')
(123, 'Hunter S. Shively', 'Forestry', 'ENA Gas Central', 'VP Trading', 'Male', 'Senior')
(124, 'Jeff Skilling', 'Other', 'Enron', 'President & CEO', 'Male', 'Senior')
(125, 'Ryan Slinger', 'Other', 'ENA West Power Real Time', 'Specialist', 'Male', 'Junior')
(126, 'Matt Smith', 'Other', 'ENA Gas West', 'Associate', 'Male', 'Junior')
(127, 'Geir Solberg', 'Other', 'ENA West Power Real Time', 'Analyst', 'Male', 'Junior')
(128, 'Steven P. South', 'Forestry', 'ENA Gas West', 'Dir Trading', 'Male', 'Senior')
(131, 'James D. Steffes', 'Legal', 'Regulatory and Government Affairs', 'VP of Government Affairs', 'Male', 'Senior')
(132, 'Joe Stepenovitch', 'Other', 'ENA East Power', 'Specialist', 'Male', 'Junior')
(133, 'Chris Stokley', 'Other', 'ENA West Power', 'Specialist', 'Male', 'Junior')
(134, 'Geoff Storey', 'Forestry', 'ENA Gas Central', 'Dir Trading', 'Male', 'Senior')
(135, 'Fletcher J. Sturm', 'Forestry', 'ENA East Power', 'VP Trading', 'Male', 'Senior')
(136, 'Mike Swerzbin', 'Forestry', 'ENA West Power', 'VP Trading', 'Male', 'Senior')
(138, 'Mark E. Taylor', 'Legal', 'ENA Legal', 'VP & Gen Cnsl', 'Male', 'Senior')
(139, 'Michael E. Taylor', 'Forestry', 'Energy Operations', 'Trader', 'Male', 'Junior')
(141, 'Paul D. Thomas', 'Other', 'ENA East Power', 'Associate', 'Male', 'Junior')
(143, 'Barry Tycholiz', 'Forestry', 'ENA Gas West', 'VP Trading', 'Male', 'Senior')
(146, 'V Charles Weldon', 'Other', 'ENA Gas Texas', 'Associate', 'Male', 'Junior')
(147, 'Greg Whalley', 'Other', 'EWS', 'President & CEO', 'Male', 'Senior')
(149, 'Mark Whitt', 'Forestry', 'ENA Gas West', 'VP Trading', 'Male', 'Senior')
(150, 'Jason Williams', 'Other', 'ENA Gas Central', 'Specialist', 'Male', 'Junior')
(151, 'Bill Williams III', 'Other', 'ENA West Power Real Time', 'Analyst', 'Male', 'Junior')
(152, 'Jason Wolfe', 'Other', 'ENA Gas West', 'Analyst', 'Male', 'Junior')
(153, 'Paul Y’Barbo', 'Other', 'ETS', 'Director', 'Male', 'Senior')
(154, 'Andy Zipper', 'Other', 'EWS', 'VP of Enron Online', 'Male', 'Senior')
(155, 'John Zufferli', 'Other', 'EWS', 'VP of Enron Canada', 'Male', 'Senior')
(156, 'Phillip K. Allen', 'Forestry', 'ENA Gas West', 'Mng Dir Trading', 'Male', 'Senior')

#### Import each of the 3 tables to a Pandas Dataframes

In [26]:
import pandas as pd
employees = pd.read_sql("SELECT * FROM EmployeeBase;", conn)
recipients = pd.read_sql("SELECT * FROM RecipientBase;", conn)
messages = pd.read_sql("SELECT * FROM MessageBase;", conn)

In [27]:
recipients.head(10)

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49
5    4    3     120
6    4    4      59
7    5    1      45
8    5    2      53
9    6    1     113

## 2. Data Exploration

Use the 3 dataframes to answer the following questions:

1. How many employees are there in the company?
- How many messages are there in the database?
- Some messages are sent to more than one recipient. Group the messages by message_id and count the number of recepients. Then look at the distribution of recepient numbers.
    - How many messages have only one recepient?
    - How many messages have >= 5 recepients?
    - What's the highest number of recepients?
    - Who sent the message with the highest number of recepients?
- Plot the distribution of recepient numbers using Bokeh.

In [28]:
employees.describe()

              eid
count  156.000000
mean    78.500000
std     45.177428
min      1.000000
25%     39.750000
50%     78.500000
75%    117.250000
max    156.000000

In [30]:
messages.describe()

                mid     unix_time      from_eid
count  21635.000000  2.163500e+04  21635.000000
mean   10818.000000  9.853194e+08     78.820800
std     6245.630873  1.972066e+07     45.203487
min        1.000000  9.109300e+08      1.000000
25%     5409.500000  9.722714e+08     42.000000
50%    10818.000000  9.870878e+08     72.000000
75%    16226.500000  1.002635e+09    120.000000
max    21635.000000  1.024667e+09    156.000000

In [31]:
recipients.describe()

                mid           rno        to_eid
count  38388.000000  38388.000000  38388.000000
mean   10952.515239      2.380900     83.140513
std     6066.838042      3.303827     44.993791
min        1.000000      1.000000      1.000000
25%     5899.000000      1.000000     47.000000
50%    11070.000000      1.000000     80.000000
75%    15964.000000      3.000000    122.000000
max    21635.000000     57.000000    156.000000

## 3. Data Merging

Use the pandas merge function to combine the information in the 3 dataframes to answer the following questions:

1. Are there more Men or Women employees?
- How is gender distributed across departments?
- Who is sending more emails? Men or Women?
- What's the average number of emails sent by each gender?
- Are there more Juniors or Seniors?
- Who is sending more emails? Juniors or Seniors?
- Which department is sending more emails? How does that relate with the number of employees in the department?
- Who are the top 3 senders of emails? (people who sent out the most emails)